Repository: TopScrech/Swifty-Master
Catalog: iOS/Localizable.xcstrings
Source language: en
Languages: de, fr, hi, nl, ru, tr, uk

source: The .padding() modifier adds space around a view, and can be customized by size, edges, or both to control layout spacing
de: Der .padding()-Modifikator fügt einer Ansicht Abstand hinzu und kann nach Größe, Kanten oder beidem angepasst werden, um Layoutabstände zu steuern
fr: Le modificateur .padding() ajoute de l’espace autour d’une vue et peut être personnalisé par taille, par bords ou les deux pour contrôler les espacements de mise en page
hi: .padding() modifier view के आसपास space जोड़ता है और layout spacing control करने के लिए size, edges या दोनों से customize किया जा सकता है
nl: De modifier .padding() voegt ruimte rond een weergave toe en kan per grootte, rand of beide worden aangepast om de layout te sturen
ru: Модификатор .padding() добавляет пространство вокруг представления и может настраиваться по размеру, краям или сразу по обоим параметрам для управления layout
tr: .padding() modifier view çevresine space ekler; layout spacing kontrolü için size, edges veya her ikisiyle customize edilebilir
uk: Modifier .padding() додає space навколо view і може налаштовуватися за size, edges або обома параметрами для control layout spacing

source: The .preferredColorScheme(_:) modifier forces a view to display in a specific color scheme, regardless of the system setting
de: Der .preferredColorScheme(_:)-Modifikator erzwingt, dass eine Ansicht unabhängig von der Systemeinstellung in einem bestimmten Farbschema angezeigt wird
fr: Le modificateur .preferredColorScheme(_:) force une vue à s’afficher dans un jeu de couleurs précis, indépendamment du réglage système
hi: .preferredColorScheme(_:) modifier system setting की परवाह किए बिना view को specific color scheme में display करने के लिए force करता है
nl: De modifier .preferredColorScheme(_:) dwingt een view om in een specifiek kleurenschema te verschijnen, ongeacht de systeeminstelling
ru: Модификатор .preferredColorScheme(_:) принудительно отображает представление в выбранной цветовой схеме независимо от системной настройки
tr: .preferredColorScheme(_:) modifier, system setting ne olursa olsun view’ı belirli bir color scheme içinde display etmeye zorlar
uk: Modifier .preferredColorScheme(_:) примушує view відображатися у specific color scheme незалежно від system setting

source: The @Environment(\.colorScheme) property lets you detect whether the system is in light or dark mode so you can adjust your UI accordingly
de: Mit der Eigenschaft @Environment(\.colorScheme) kannst du erkennen, ob das System im hellen oder dunklen Modus ist, und deine UI entsprechend anpassen
fr: La propriété @Environment(\.colorScheme) permet de détecter si le système est en mode clair ou sombre afin d’adapter votre interface en conséquence
hi: @Environment(\.colorScheme) property आपको detect करने देती है कि system light या dark mode में है, ताकि आप UI accordingly adjust कर सकें
nl: Met de eigenschap @Environment(\.colorScheme) kun je detecteren of het systeem in de lichte of donkere modus staat, zodat je je UI daarop kunt aanpassen
ru: Свойство @Environment(\.colorScheme) позволяет определить, использует ли система светлую или темную тему, чтобы вы могли адаптировать интерфейс
tr: @Environment(\.colorScheme) property, system’ın light veya dark mode’da olup olmadığını algılamanızı sağlar; böylece UI’ı buna göre adjust edebilirsiniz
uk: Property @Environment(\.colorScheme) дає змогу визначати, чи system у light або dark mode, щоб відповідно adjust UI

source: The App Store overlay lets you promote an app that’s already published on the App Store and even trigger updates for it
de: Mit dem App-Store-Overlay kannst du eine bereits im App Store veröffentlichte App bewerben und sogar Updates dafür auslösen
fr: L’overlay App Store permet de promouvoir une app déjà publiée sur l’App Store et même de déclencher ses mises à jour
hi: App Store overlay आपको App Store पर पहले से published app promote करने और उसके updates trigger करने देता है
nl: Met de App Store-overlay kun je een app promoten die al in de App Store staat en zelfs updates activeren
ru: Оверлей App Store позволяет продвигать приложение, уже опубликованное в App Store, и даже запускать обновления
tr: App Store overlay, App Store’da zaten published olan bir app’i promote etmenizi ve hatta onun updates değerlerini trigger etmenizi sağlar
uk: App Store overlay дає змогу просувати app, яка вже опублікована в App Store, і навіть запускати updates для неї

source: The Label view combines text with an icon, which can come from SF Symbols, your asset catalog, or a fully custom view, and can be styled with different label styles
de: Die Label-Ansicht kombiniert Text mit einem Icon, das aus SF Symbols, deinem Asset-Katalog oder einer vollständig eigenen Ansicht stammen kann, und kann mit verschiedenen Label-Stilen gestaltet werden
fr: La vue Label combine du texte avec une icône, qui peut provenir de SF Symbols, de votre catalogue d’assets ou d’une vue entièrement personnalisée, et peut être stylisée avec différents styles de label
hi: Label view text को icon के साथ combine करती है, जो SF Symbols, आपके asset catalog या fully custom view से आ सकता है, और इसे different label styles से style किया जा सकता है
nl: De Label-view combineert tekst met een pictogram, dat uit SF Symbols, je assetcatalogus of een volledig aangepaste view kan komen, en kan met verschillende labelstijlen worden opgemaakt
ru: Представление Label сочетает текст с иконкой, которая может быть из SF Symbols, вашего каталога ресурсов или полностью пользовательского представления, и поддерживает разные стили label
tr: Label view, text’i SF Symbols, asset catalog veya fully custom view’dan gelebilen bir icon ile birleştirir ve different label styles ile style edilebilir
uk: Label view поєднує text з icon, яка може походити з SF Symbols, вашого asset catalog або fully custom view, і може style за допомогою різних label styles

source: The top bar in a navigation container that can show titles, buttons, and other controls
de: Die obere Leiste in einem Navigationscontainer, die Titel, Buttons und andere Steuerelemente anzeigen kann
fr: La barre supérieure d’un conteneur de navigation, qui peut afficher des titres, des boutons et d’autres contrôles
hi: Navigation container की top bar जो titles, buttons और अन्य controls दिखा सकती है
nl: De bovenste balk in een navigatiecontainer die titels, knoppen en andere bedieningselementen kan tonen
ru: Верхняя панель в контейнере навигации, на которой могут отображаться заголовки, кнопки и другие элементы управления
tr: Navigation container içindeki, titles, buttons ve diğer controls gösterebilen top bar
uk: Верхня панель у navigation container, яка може показувати titles, buttons та інші controls

source: This app already includes icon switch buttons in Settings > Debug
de: Diese App enthält bereits Buttons zum Wechseln des Icons unter Einstellungen > Debug
fr: Cette app inclut déjà des boutons de changement d’icône dans Réglages > Debug
hi: इस app में Settings > Debug में icon switch buttons पहले से शामिल हैं
nl: Deze app bevat al knoppen voor het wisselen van iconen in Instellingen > Debug
ru: В этом приложении уже есть кнопки для переключения иконок в Настройки > Debug
tr: Bu app Settings > Debug içinde icon switch buttons zaten içerir
uk: Ця app уже містить кнопки перемикання icon у Settings > Debug

source: This UIKit technique can reduce screenshots but is not a guarantee
de: Diese UIKit-Technik kann Screenshots reduzieren, ist aber keine Garantie
fr: Cette technique UIKit peut réduire les captures d’écran, mais ce n’est pas une garantie
hi: यह UIKit technique screenshots कम कर सकती है, लेकिन guarantee नहीं है
nl: Deze UIKit-techniek kan screenshots verminderen, maar biedt geen garantie
ru: Этот прием UIKit может уменьшить вероятность скриншотов, но не дает гарантии
tr: Bu UIKit technique screenshots’ı azaltabilir, ancak garanti değildir
uk: Ця UIKit technique може зменшити screenshots, але не є гарантією

source: Title
de: Titel
fr: Titre
nl: Titel
ru: Заголовок

source: To dismiss a sheet before ios 15, there is a change to make only in the sheet content
de: Um ein Sheet vor iOS 15 zu schließen, muss nur im Sheet-Inhalt eine Änderung vorgenommen werden
fr: Pour fermer une sheet avant iOS 15, il suffit de modifier uniquement le contenu de la sheet
hi: iOS 15 से पहले sheet dismiss करने के लिए केवल sheet content में change करना होता है
nl: Om een sheet vóór iOS 15 te sluiten, hoef je alleen iets te wijzigen in de inhoud van de sheet
ru: Чтобы закрыть sheet до iOS 15, нужно внести изменение только в содержимое sheet
tr: iOS 15 öncesinde bir sheet dismiss etmek için yalnızca sheet content içinde değişiklik yapmak gerekir
uk: Щоб dismiss sheet до iOS 15, потрібно змінити лише sheet content

source: Toggle lets users switch a value on or off, and can be bound to a state property to update your UI automatically
de: Toggle ermöglicht Benutzern, einen Wert ein- oder auszuschalten, und kann an eine State-Eigenschaft gebunden werden, um deine UI automatisch zu aktualisieren
fr: Toggle permet aux utilisateurs d’activer ou de désactiver une valeur et peut être lié à une propriété d’état pour mettre à jour automatiquement votre interface
hi: Toggle users को value on या off switch करने देता है और UI automatically update करने के लिए state property से bind किया जा सकता है
nl: Toggle laat gebruikers een waarde aan- of uitzetten en kan worden gekoppeld aan een state-property om je UI automatisch bij te werken
ru: Toggle позволяет пользователям включать и выключать значение и может быть привязан к свойству state для автоматического обновления интерфейса
tr: Toggle, users’ın bir value’yu on veya off yapmasını sağlar ve UI’ı otomatik update etmek için state property’ye bind edilebilir
uk: Toggle дає користувачам змогу вмикати або вимикати value і може бути bound до state property для автоматичного update UI

source: Topics
de: Themen
fr: Sujets
nl: Onderwerpen
ru: Темы
tr: Konular
uk: Теми

source: Try it in Settings
de: Probiere es in den Einstellungen aus
fr: Essayez dans Réglages
hi: Settings में try करें
nl: Probeer het in Instellingen
ru: Попробуйте в Настройках
tr: Settings içinde deneyin
uk: Спробуйте в Settings

source: Turn this back off when you no longer need it to avoid extra battery drain
de: Schalte dies wieder aus, wenn du es nicht mehr brauchst, um zusätzlichen Akkuverbrauch zu vermeiden
fr: Désactivez à nouveau cette option lorsque vous n’en avez plus besoin afin d’éviter une consommation supplémentaire de batterie
hi: जब इसकी ज़रूरत न रहे तो extra battery drain से बचने के लिए इसे वापस off कर दें
nl: Schakel dit weer uit zodra je het niet meer nodig hebt om extra batterijverbruik te voorkomen
ru: Отключите это, когда функция больше не нужна, чтобы избежать лишнего расхода батареи
tr: Ek battery drain önlemek için artık gerekmediğinde bunu tekrar off yapın
uk: Вимкніть це знову, коли воно більше не потрібне, щоб уникнути додаткового battery drain

source: Two columns
de: Zwei Spalten
fr: Deux colonnes
hi: दो columns
nl: Twee kolommen
ru: Две колонки
tr: İki column
uk: Два стовпці

source: UIScreen.main.bounds gives you the screen’s width and height, which you can use to size views dynamically
de: UIScreen.main.bounds liefert Breite und Höhe des Bildschirms, womit du Ansichten dynamisch dimensionieren kannst
fr: UIScreen.main.bounds donne la largeur et la hauteur de l’écran, que vous pouvez utiliser pour dimensionner les vues dynamiquement
hi: UIScreen.main.bounds screen की width और height देता है, जिसका उपयोग आप views को dynamically size करने के लिए कर सकते हैं
nl: UIScreen.main.bounds geeft je de breedte en hoogte van het scherm, die je kunt gebruiken om weergaven dynamisch te schalen
ru: UIScreen.main.bounds дает ширину и высоту экрана, которые можно использовать для динамического размера представлений
tr: UIScreen.main.bounds screen width ve height değerlerini verir; bunları views’ı dynamically size etmek için kullanabilirsiniz
uk: UIScreen.main.bounds дає width і height екрана, які можна використовувати для динамічного sizing views

source: Undo favorite
de: Favorit rückgängig machen
fr: Annuler le favori
hi: Favorite undo करें
nl: Favoriet ongedaan maken
ru: Убрать из избранного
tr: Favoriyi geri al
uk: Скасувати обране

source: Usage with AnyView
de: Verwendung mit AnyView
fr: Utilisation avec AnyView
hi: AnyView के साथ usage
nl: Gebruik met AnyView
ru: Использование с AnyView
tr: AnyView ile kullanım
uk: Використання з AnyView

source: Use a secure text entry mask to discourage screenshots of sensitive UI
de: Verwende eine sichere Texteingabemaske, um Screenshots sensibler UI zu erschweren
fr: Utilisez un masque de saisie sécurisé pour décourager les captures d’écran d’une interface sensible
hi: Sensitive UI के screenshots discourage करने के लिए secure text entry mask use करें
nl: Gebruik een veilige invoermasker voor tekst om screenshots van gevoelige UI te ontmoedigen
ru: Используйте защищенную маску текстового ввода, чтобы затруднить создание скриншотов чувствительного интерфейса
tr: Sensitive UI screenshots’ını caydırmak için secure text entry mask kullanın
uk: Використовуйте secure text entry mask, щоб перешкоджати screenshots sensitive UI

source: Use built-in Safari
de: Integriertes Safari verwenden
fr: Utiliser Safari intégré
hi: Built-in Safari use करें
nl: Gebruik ingebouwde Safari
ru: Использовать встроенный Safari
tr: Built-in Safari kullan
uk: Використовувати вбудований Safari

source: View
de: Ansicht
fr: Vue
nl: Weergave
ru: Представление

source: When using a function that returns AnyView via a switch statement, EmptyView() is a convenient and concise default case. It avoids unnecessary layout calculations while still satisfying the return type
de: Wenn du eine Funktion verwendest, die AnyView über eine switch-Anweisung zurückgibt, ist EmptyView() ein praktischer und knapper Standardfall. Es vermeidet unnötige Layoutberechnungen und erfüllt trotzdem den Rückgabetyp
fr: Lorsque vous utilisez une fonction qui renvoie AnyView via une instruction switch, EmptyView() est un cas par défaut pratique et concis. Il évite des calculs de mise en page inutiles tout en satisfaisant le type de retour
hi: जब कोई function switch statement के जरिए AnyView return करता है, EmptyView() convenient और concise default case है. यह return type satisfy करते हुए unnecessary layout calculations से बचाता है
nl: Wanneer je een functie gebruikt die via een switch AnyView retourneert, is EmptyView() een handige en beknopte standaardcase. Het voorkomt onnodige layoutberekeningen en voldoet toch aan het retourtype
ru: Когда функция через switch возвращает AnyView, EmptyView() становится удобным и лаконичным вариантом по умолчанию. Он избегает лишних вычислений layout и при этом удовлетворяет требуемому возвращаемому типу
tr: Switch statement ile AnyView döndüren bir function kullanırken EmptyView() pratik ve kısa bir default case’tir. Return type’ı karşılarken gereksiz layout calculations’ı önler
uk: Коли function повертає AnyView через switch statement, EmptyView() є зручним і стислим default case. Він уникає зайвих layout calculations, водночас задовольняючи return type

source: App Store Overlay
fr: Overlay App Store
ru: Оверлей App Store

source: Button
fr: Bouton
nl: Knop
ru: Кнопка

source: Drag & Drop
fr: Glisser-déposer
nl: Slepen en neerzetten
ru: Перетаскивание

source: Layout
fr: Mise en page
nl: Opmaak
ru: Разметка

source: Stretchy Header
fr: En-tête étirable
nl: Uitrekbare header
ru: Растягивающийся заголовок

source: System
fr: Système
nl: Systeem
ru: Система

source: Design
nl: Ontwerp
ru: Дизайн
tr: Tasarım
uk: Дизайн

source: Navigation
nl: Navigatie
ru: Навигация
uk: Навігація

source: Stack
nl: Stapel
ru: Стэк

source: Toggle
nl: Schakelaar
ru: Переключатель

source: Debug
ru: Отладка

source: Link
ru: Ссылка
